[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  //Altereio para matar o mutante equivalente que troca o || por &&, mas mesmo assim não não foi morto completamente
-  if (n === 0) return 1;
-  if (n === 1) return 1;
-
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:20:7
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   //Altereio para matar o mutante equivalente que troca o || por &&, mas mesmo assim não não foi morto completamente
-  if (n === 0) return 1;
+  if (n !== 0) return 1;
   if (n === 1) return 1;
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:20:7
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   //Altereio para matar o mutante equivalente que troca o || por &&, mas mesmo assim não não foi morto completamente
-  if (n === 0) return 1;
+  if (true) return 1;
   if (n === 1) return 1;
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:21:7
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   //Altereio para matar o mutante equivalente que troca o || por &&, mas mesmo assim não não foi morto completamente
   if (n === 0) return 1;
-  if (n === 1) return 1;
+  if (n !== 1) return 1;
 
   let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:21:7
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   //Altereio para matar o mutante equivalente que troca o || por &&, mas mesmo assim não não foi morto completamente
   if (n === 0) return 1;
-  if (n === 1) return 1;
+  if (true) return 1;
 
   let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] BlockStatement
src/operacoes.js:49:49
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
-function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
+function aumentarPorcentagem(valor, percentual) {}
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function inverterSinal(n) { return -n; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 18. deve aumentar um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:64:44
 function hipotenusa(catetoA, catetoB) {
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
-function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
+function grausParaRadianos(graus) { return graus / (Math.PI / 180); }
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 29. deve converter graus para radianos
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 3.141592653589793
Received: 10313.240312354817

Expected precision:    2
Expected difference: < 0.005
Received difference:   10310.098719701227

[Killed] BlockStatement
src/operacoes.js:87:32
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 //Alterei essa função para matar o mutante equivalente que troca a ordem (val * acc)
-function produtoArray(numeros) {
-  if (numeros.length === 0) return 1;
-  let resultado = numeros[0];
-  for (let i = 1; i < numeros.length; i++) {
-    resultado = resultado * numeros[i];
-  }
-  return resultado;
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   if (valor < min) return min;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:90:19
 function produtoArray(numeros) {
   if (numeros.length === 0) return 1;
   let resultado = numeros[0];
-  for (let i = 1; i < numeros.length; i++) {
+  for (let i = 1; i <= numeros.length; i++) {
     resultado = resultado * numeros[i];
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: NaN

[Killed] BlockStatement
src/operacoes.js:90:44
 function produtoArray(numeros) {
   if (numeros.length === 0) return 1;
   let resultado = numeros[0];
-  for (let i = 1; i < numeros.length; i++) {
-    resultado = resultado * numeros[i];
-  }
+  for (let i = 1; i < numeros.length; i++) {}
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 2

[Killed] ArithmeticOperator
src/operacoes.js:91:17
   if (numeros.length === 0) return 1;
   let resultado = numeros[0];
   for (let i = 1; i < numeros.length; i++) {
-    resultado = resultado * numeros[i];
+    resultado = resultado / numeros[i];
   }
   return resultado;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.16666666666666666
