[Killed] EqualityOperator
src/operacoes.js:18:7
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
+  if (n <= 0) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas deve verificar fatorial retornar 1 se n é 0 ou 1
statusReason: Error: Fatorial não é definido para números negativos.
